Ran Plan for 2 projects:

1. dir: `terraform` workspace: `default`
1. dir: `.` workspace: `default`
---

### 1. dir: `terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.foo will be created
+ resource "local_file" "foo" {
      + content              = "foo!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./foo.txt"
      + id                   = (known after apply)
    }

  # null_resource.default will be created
+ resource "null_resource" "default" {
      + id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `.` workspace: `default`
**Plan Error**
```
running "/usr/local/bin/terraform plan -input=false -refresh -out \"/root/.atlantis/repos/Tomelin/terraform-atlantis/5/default/default.tfplan\"" in "/root/.atlantis/repos/Tomelin/terraform-atlantis/5/default": exit status 1
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

```

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed